app/Controllers/Admin/BiayaTambahan.php

SELECT *
FROM `biaya_tambahan`
---
    public function index()
    {
        $data = [
            'title' => 'Biaya Tambahan',
            'biaya' => $this->biayaTambahanModel->findAll()