app/Controllers/Admin/Cabang.php

    public function index()
    {
        $data = [
            'title'  => 'Data Cabang Toko',
            'cabang' => $this->cabangModel->findAll()
---
SELECT *
FROM `cabang`