app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $karyawanModel  = new KaryawanModel();
        $cabangModel    = new CabangModel();
        $transaksiModel = new TransaksiModel();
        $userModel      = new UserModel();

        // Mengambil data transaksi khusus hari ini
        $hariIni = date('Y-m-d');
        $transaksiHariIni = $transaksiModel->where('tanggal', $hariIni)->findAll();

        // Menjumlahkan total pendapatan hari ini
        $pendapatanHariIni = array_sum(array_column($transaksiHariIni, 'total_pendapatan'));

        $data = [
            'title'               => 'Dashboard Admin',
            'total_karyawan'      => $karyawanModel->countAllResults(),
            'total_cabang'        => $cabangModel->countAllResults(),
            'total_kasir'         => $userModel->where('role', 'kasir')->countAllResults(),
---
SELECT *
FROM `transaksi`
WHERE `tanggal` = '2026-03-13'
SELECT COUNT(*) AS `numrows`
FROM `karyawan`
SELECT COUNT(*) AS `numrows`
FROM `cabang`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'kasir'