app/Controllers/Admin/DataAdmin.php

    public function index()
    {
        $data = [
            'title'  => 'Data Admin',
            'admins' => $this->userModel->where('role', 'admin')->findAll()
---
SELECT *
FROM `users`
WHERE `role` = 'admin'