app/Controllers/Admin/Karyawan.php

SELECT `karyawan`.*, `cabang`.`nama_cabang`
FROM `karyawan`
JOIN `cabang` ON `cabang`.`id` = `karyawan`.`id_cabang`
SELECT *
FROM `cabang`
---
    public function index()
    {
        $data = [
            'title'    => 'Data Karyawan',
            'karyawan' => $this->karyawanModel->select('karyawan.*, cabang.nama_cabang')
                                              ->join('cabang', 'cabang.id = karyawan.id_cabang')
                                              ->findAll(),
            'cabang'   => $this->cabangModel->findAll()