app/Controllers/Admin/Setting.php

    public function index()
    {
        $data = [
            'title'   => 'Setting Barbershop',
            'setting' => $this->settingModel->first()
---
SELECT *
FROM `setting`
 LIMIT 1